/* 
* vg.cpp
*
* Created: 07.11.2017 13:19:00
* Author: GumerovMN
*/


#include "vg.h"

namespace VG
{
	// *************** adc core **********************
	// длина буффера усреднения для вычисления скорости
	uint16_t EEMEM adcCore_speedLenghtAve		= 100;
	uint16_t adcCore_speedLenghtAve_ram;
	// длина буффера дельты для нахождения скорости
	uint8_t EEMEM adcCore_speedLenghtDlt		= 10;
	uint8_t adcCore_speedLenghtDlt_ram;
	// длина буффера усреднения данных для архивации дистанции
	uint8_t EEMEM adcCore_distanceLenghtAve		= 5;
	// длина буффера усреднения данных для архивации услилия
	uint8_t EEMEM adcCore_forceLenghtAve		= 5;
	// ************* mode work ***********************
	// защитный интервал при старте двигателя (тиках)
	uint16_t EEMEM safeIntervalEngineOn_set		= 10000;
	// -------------------------------------------------------------------------------------
	// защитный интервал при останове двигателя (тиках)
	uint16_t EEMEM safeIntervalEngineOff_set	= 10000;
	// -------------------------------------------------------------------------------------
	// время отстрочки регистрации начало выдвижения штока
	uint16_t EEMEM thresholdSpeedStockTimeForwardStart_set	= 5;
	// время отстрочки регистрации окончания выдвижения штока
	uint16_t EEMEM thresholdSpeedStockTimeForwardStop_set	= 5;
	// время отстрочки регистрации начало задвижения штока
	uint16_t EEMEM thresholdSpeedStockTimeBackStart_set		= 5;
	// время отстрочки регистрации окончания задвижения штока
	uint16_t EEMEM thresholdSpeedStockTimeBackStop_set		= 5;
	// ===========================================================================
	// порог скорости старта выдвижения штока ( (единица ацп / тик) * длина массива нахождения дельты )
	uint16_t EEMEM thresholdSpeedStockForward_start	= 5;
	// порог скорости остановки выдвижения штока ( (единица ацп / тик) * длина массива нахождения дельты )
	uint16_t EEMEM thresholdSpeedStockForward_stop	= 3;
	// -------------------------------------------------------------------------------------
	// порог скорости старта задвижения штока ( (единица ацп / тик) * длина массива нахождения дельты )
	uint16_t EEMEM thresholdSpeedStockBack_start	= 5;
	// порог скорости остановки задвижения штока ( (единица ацп / тик) * длина массива нахождения дельты )
	uint16_t EEMEM thresholdSpeedStockBack_stop		= 3;
	// ===========================================================================
	// время нахождения штока на полке (тиках)
	uint16_t EEMEM timeStockShelf_set				= 3000;
	// -------------------------------------------------------------------------------------
	// время нахождения штока в исходном положении (тиках)
	uint16_t EEMEM timeStockDelay_set				= 3000;
	// -------------------------------------------------------------------------------------
	// минимальное время alarm
	uint16_t EEMEM timeAlarm_set					= 5000;
	// ===========================================================================
	// максимальное число измерений на автомате
	uint8_t EEMEM n_cycle_max = 15;
	// ===========================================================================
	// время переключения контактов переключателя****
	uint16_t EEMEM switch1_delay				= 500;
	uint16_t EEMEM switch2_delay				= 500;
}
